This notebook demonstrates how to perform MySQL database connectivity in Python and perform data exploration by writing sql queries.

In [22]:
import pandas as pd
# import library to establish connection with SQL database
import mysql.connector
con=mysql.connector.connect(host="localhost",
                           port=3306,
                           user="root",
                           password="prerna7217",
                           database="prerna")

In [23]:
def Q(sql):
    res=pd.read_sql_query(sql,con)
    return (res)

In [25]:
st=Q("select * from titanic")
st.head(5)

,Passenger,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7,,S\r
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71,C85,C\r
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,8,,S\r
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53,C123,S\r
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8,,S\r

In [42]:
st=Q("select  distinct(Sex) from titanic")
st

      Sex
0    male
1  female

In [28]:
st=Q("select max(Fare) from titanic")
st

   max(Fare)
0        512

In [29]:
st=Q("select min(Fare) from titanic")
st

   min(Fare)
0          0

In [30]:
st=Q("select avg(Fare) from titanic")
st

   avg(Fare)
0    32.2637

In [32]:
st=Q("select  distinct(Embarked) from titanic")
st

  Embarked
0      S\r
1      C\r
2      Q\r
3       \r

In [35]:
st=Q("select  distinct(Parch) from titanic")
st

   Parch
0      0
1      1
2      2
3      5
4      3
5      4
6      6

In [36]:
st=Q("select avg(Age) from titanic")
st

   avg(Age)
0   23.8103

In [37]:
st=Q("select max(Age) from titanic")
st

   max(Age)
0        80

In [38]:
st=Q("select min(Age) from titanic")
st

   min(Age)
0         0

In [40]:
st=Q("select  distinct(Pclass) from titanic")
st

   Pclass
0       3
1       1
2       2

In [51]:
st=Q("select Age from titanic where Age BETWEEN 50 AND 80 GROUP BY  Pclass")
st

   Age
0   54
1   55
2   59

In [ ]:
SELECT COUNT(CustomerID), Country
FROM Customers
GROUP BY Country
HAVING COUNT(CustomerID) > 5
ORDER BY COUNT(CustomerID) DESC;

In [56]:
st=Q("select count(Sibsp) from titanic GROUP BY Embarked HAVING COUNT(Sibsp)>1 ORDER BY count(Sibsp) DESC")
st

   count(Sibsp)
0           644
1           168
2            77
3             2

In [ ]:
SELECT ProductName
FROM Products
WHERE ProductID = ANY (SELECT ProductID FROM OrderDetails WHERE Quantity = 10);

In [63]:
st=Q("select Sex from titanic WHERE Survived = 1")
st.head(5)

      Sex
0  female
1  female
2  female
3  female
4  female

In [ ]:
SELECT column_name(s)
FROM table_name
WHERE column_name operator ALL
(SELECT column_name FROM table_name WHERE condition);

In [70]:
st=Q("select Fare from titanic WHERE Pclass = 3")
st.head()

   Fare
0     7
1     8
2     8
3     8
4    21

In [73]:
st=Q("select Sibsp from titanic WHERE Sibsp >=2")
st.head()

   Sibsp
0      3
1      4
2      3
3      3
4      2

In [78]:
st=Q("select Survived from titanic where Sex = 'female' ")
st.head(7)

   Survived
0         1
1         1
2         1
3         1
4         1
5         1
6         1

In [88]:
st=Q("select * from titanic WHERE Sex = 'female' AND (Survived=0 AND Age BETWEEN 20 AND 50)")
st.head(5)

,Passenger,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31,1,0,345763,18,,S\r
1,41,0,3,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",female,40,1,0,7546,9,,S\r
2,42,0,2,"Turpin, Mrs. William John Robert (Dorothy Ann ...",female,27,1,0,11668,21,,S\r
3,101,0,3,"Petranec, Miss. Matilda",female,28,0,0,349245,8,,S\r
4,114,0,3,"Jussila, Miss. Katriina",female,20,1,0,4136,10,,S\r

In [86]:
st=Q("select Pclass from titanic WHERE Sex = 'male' AND (Survived=1 AND Age <=40)")
st.head(5)

   Pclass
0       2
1       2
2       1
3       3
4       1

In [ ]:
SELECT column_names
FROM table_name
WHERE column_name IS NULL;

In [93]:
st=Q("select Fare from titanic WHERE Fare IS NOT NULL")
st.head(7)

   Fare
0     7
1    71
2     8
3    53
4     8
5     8
6    52

st =Q("Select * from titanic WHERE Parch =5 LIMIT 4")
st

In [108]:
st =Q("Select * from titanic WHERE Embarked = 'S\r' AND Sex = 'male' AND Fare>=25 ")
st.head(3)

,Passenger,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,7,0,1,"McCarthy, Mr. Timothy J",male,54,0,0,17463,52,E46,S\r
1,14,0,3,"Andersson, Mr. Anders Johan",male,39,1,5,347082,31,,S\r
2,21,0,2,"Fynney, Mr. Joseph J",male,35,0,0,239865,26,,S\r

In [110]:
st=Q("select * from titanic WHERE Name like 'b%' LIMIT 5")
st

,Passenger,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7,,S\r
1,12,1,1,"Bonnell, Miss. Elizabeth",female,58,0,0,113783,27,C103,S\r
2,22,1,2,"Beesley, Mr. Lawrence",male,34,0,0,248698,13,D56,S\r
3,75,1,3,"Bing, Mr. Lee",male,32,0,0,1601,56,,S\r
4,86,1,3,"Backstrom, Mrs. Karl Alfred (Maria Mathilda Gu...",female,33,3,0,3101278,16,,S\r

In [113]:
st=Q("select Age from titanic WHERE Pclass=3 AND SibSp=3 AND Survived =0 LIMIT 4")
st

   Age
0    2
1    8
2    4
3    0

This way we can write n number of queries for data wrangling/mining purposes in the pyhton after establishing connection with the database.